// ЦИКЛ WHILE
/*let i = 0;
while (i <= 5) {
    console.log(i);
    i++;
}*/

/*let i = 3;
while (i > -5) {
    console.log(i--);
}*/

/*let i = 3;
while (i) {
    console.log(i--); // 3, 2, 1
}*/

/*let j = 0;
while (++j < 5) {
    console.log(j); // 1, 2, 3, 4
}*/

/* let j = 0;
while (j++ < 5) {
    console.log(j); // 1, 2, 3, 4, 5
} */

// let i = 10;
// while (--i > 5) {
//     console.log(i); // 9, 8, 7, 6
// }

/* let i = 10;
while (i-- >= 5) {
    console.log(i); // 9, 8, 7, 6, 5, 4 (10 не выводит, т.к вывод в консоль это следующий вызов переменной)
} */
/************************************************************** */

// ЦИКЛ DO WHILE
/*let i = 0;
do {
    console.log(i);
    i++
} while (i <= 5);*/

/************************************************************** */

// ЦИКЛ FOR

/* for (let i = 10; i >= 5; i--) {
    console.log(i); // 10, 9, 8, 7, 6, 5
} */

/* for (let i = 10; i-- >= 5;) {
    console.log(i); // 9, 8, 7, 6, 5
} */

/* for (let i = 10; i >= 5; --i) {
    console.log(i); // 10, 9, 8, 7, 6, 5
} */

/* for (let i = 9; i > 5; --i) {
    console.log(i); // 9, 8, 7, 6
} */

// FOR хоть и массивный, но более понятный и не требует внешнего объявления переменных. Снижает риски.